## Plan Result (Aks_demo - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 2 to change, 18 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Update
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-demo-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a16e4c77-50e4-467f-9a3f-6b5f809b271d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/81a30382-2c18-463c-84e7-b4412f2400b4/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/federatedIdentityCredentials/cft-demo-00-aks"
        name                      = "cft-demo-00-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ tags                      = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      ~ current_kubernetes_version          = "1.30.0" -> (known after apply)
      ~ fqdn                                = "k8s-cft-demo-aks-1ab7a681.hcp.uksouth.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply)
      - image_cleaner_interval_hours        = 48 -> null
      ~ kube_admin_config                   = (sensitive value)
      ~ kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "cft-demo-00-aks"
      ~ node_resource_group_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-aks-node-rg" -> (known after apply)
      ~ oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/81a30382-2c18-463c-84e7-b4412f2400b4/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k8s-cft-demo-aks-1ab7a681.portal.hcp.uksouth.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (21 unchanged attributes hidden)

      ~ auto_scaler_profile (known after apply)
      - auto_scaler_profile {
          - balance_similar_node_groups      = false -> null
          - empty_bulk_delete_max            = "10" -> null
          - expander                         = "random" -> null
          - max_graceful_termination_sec     = "600" -> null
          - max_node_provisioning_time       = "15m" -> null
          - max_unready_nodes                = 3 -> null
          - max_unready_percentage           = 45 -> null
          - new_pod_scale_up_delay           = "0s" -> null
          - scale_down_delay_after_add       = "10m" -> null
          - scale_down_delay_after_delete    = "10s" -> null
          - scale_down_delay_after_failure   = "3m" -> null
          - scale_down_unneeded              = "10m" -> null
          - scale_down_unready               = "20m" -> null
          - scale_down_utilization_threshold = "0.5" -> null
          - scan_interval                    = "10s" -> null
          - skip_nodes_with_local_storage    = false -> null
          - skip_nodes_with_system_pods      = true -> null
        }

      ~ azure_active_directory_role_based_access_control {
          ~ tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ default_node_pool {
          - fips_enabled                  = false -> null
          - host_encryption_enabled       = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
            name                          = "system"
          ~ node_count                    = 4 -> (known after apply)
          ~ node_labels                   = {} -> (known after apply)
          - node_public_ip_enabled        = false -> null
          ~ os_sku                        = "Ubuntu" -> (known after apply)
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "demo"
            }
          + workload_runtime              = (known after apply)
            # (22 unchanged attributes hidden)

          ~ upgrade_settings {
              ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      ~ identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ key_vault_secrets_provider {
          ~ secret_identity          = [
              - {
                  - client_id                 = "bdd76452-2400-482f-97dc-f30170147b04"
                  - object_id                 = "0d208f31-f6bf-487f-b952-872a13b04393"
                  - user_assigned_identity_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/cft-demo-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-cft-demo-00-aks"
                },
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "99a49ef8-5bb8-42a1-b47d-a088e032fc14" -> null
          - object_id                 = "601cd000-4c45-4408-b193-12acfc35a5a9" -> null
          - user_assigned_identity_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-demo-00-aks-agentpool" -> null
        }

      ~ maintenance_window_node_os {
          - day_of_month = 0 -> null
          ~ start_date   = "2024-07-04T00:00:00Z" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ network_profile {
          ~ dns_service_ip      = "10.0.0.10" -> (known after apply)
          ~ ip_versions         = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode        = (known after apply)
          + network_policy      = (known after apply)
          + pod_cidr            = (known after apply)
          ~ pod_cidrs           = [] -> (known after apply)
          ~ service_cidr        = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs       = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (5 unchanged attributes hidden)

          ~ load_balancer_profile (known after apply)
          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/5d838416-154f-4ba1-9d2d-30a3a2a26465",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }

          ~ nat_gateway_profile (known after apply)
        }

      ~ windows_profile (known after apply)
      - windows_profile {
          - admin_username = "azureuser" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks/agentPools/cronjob" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply) # forces replacement
        name                          = "cronjob"
      ~ node_count                    = 0 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

      ~ upgrade_settings {
          ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply) # forces replacement
        name                          = "linux"
      ~ node_count                    = 24 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

      ~ upgrade_settings {
          ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks/agentPools/spotinstance" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply) # forces replacement
        name                          = "spotinstance"
      ~ node_count                    = 3 -> (known after apply)
      ~ node_labels                   = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.aks_auto_shutdown[0] must be replaced
-/+ resource "azurerm_role_assignment" "aks_auto_shutdown" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks/providers/Microsoft.Authorization/roleAssignments/a93bac37-1cc0-c0fb-4d21-034d6a57570f" -> (known after apply)
      ~ name                                   = "a93bac37-1cc0-c0fb-4d21-034d6a57570f" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/providers/Microsoft.Authorization/roleAssignments/f4e51a4a-9fb5-7acd-f6a2-e27e7b1897f9" -> (known after apply)
      ~ name                                   = "f4e51a4a-9fb5-7acd-f6a2-e27e7b1897f9" -> (known after apply)
      ~ principal_id                           = "601cd000-4c45-4408-b193-12acfc35a5a9" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "global_registry_acrpull" {
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/a9de54a3-e358-8e3f-8716-b8c5464468ae" -> (known after apply)
      ~ name                                   = "a9de54a3-e358-8e3f-8716-b8c5464468ae" -> (known after apply)
      ~ principal_id                           = "601cd000-4c45-4408-b193-12acfc35a5a9" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set must be replaced
-/+ resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/e7e70ca6-f251-58a2-8428-804b11dba0cc" -> (known after apply)
      ~ name                                   = "e7e70ca6-f251-58a2-8428-804b11dba0cc" -> (known after apply)
      ~ principal_id                           = "601cd000-4c45-4408-b193-12acfc35a5a9" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] must be replaced
-/+ resource "azurerm_role_assignment" "update_checker" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks/providers/Microsoft.Authorization/roleAssignments/97a2c4c5-1b5d-ee60-2619-a3171e454374" -> (known after apply)
      ~ name                                   = "97a2c4c5-1b5d-ee60-2619-a3171e454374" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0e35564d-a84d-4dd0-8d2b-0733468cc5a1/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/federatedIdentityCredentials/cft-demo-01-aks"
        name                      = "cft-demo-01-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ tags                      = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      ~ current_kubernetes_version          = "1.30.0" -> (known after apply)
      ~ fqdn                                = "k8s-cft-demo-aks-a7673977.hcp.uksouth.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply)
      - image_cleaner_interval_hours        = 48 -> null
      ~ kube_admin_config                   = (sensitive value)
      ~ kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "cft-demo-01-aks"
      ~ node_resource_group_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-aks-node-rg" -> (known after apply)
      ~ oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0e35564d-a84d-4dd0-8d2b-0733468cc5a1/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k8s-cft-demo-aks-a7673977.portal.hcp.uksouth.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (21 unchanged attributes hidden)

      ~ auto_scaler_profile (known after apply)
      - auto_scaler_profile {
          - balance_similar_node_groups      = false -> null
          - empty_bulk_delete_max            = "10" -> null
          - expander                         = "random" -> null
          - max_graceful_termination_sec     = "600" -> null
          - max_node_provisioning_time       = "15m" -> null
          - max_unready_nodes                = 3 -> null
          - max_unready_percentage           = 45 -> null
          - new_pod_scale_up_delay           = "0s" -> null
          - scale_down_delay_after_add       = "10m" -> null
          - scale_down_delay_after_delete    = "10s" -> null
          - scale_down_delay_after_failure   = "3m" -> null
          - scale_down_unneeded              = "10m" -> null
          - scale_down_unready               = "20m" -> null
          - scale_down_utilization_threshold = "0.5" -> null
          - scan_interval                    = "10s" -> null
          - skip_nodes_with_local_storage    = false -> null
          - skip_nodes_with_system_pods      = true -> null
        }

      ~ azure_active_directory_role_based_access_control {
          ~ tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ default_node_pool {
          - fips_enabled                  = false -> null
          - host_encryption_enabled       = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
            name                          = "system"
          ~ node_count                    = 4 -> (known after apply)
          ~ node_labels                   = {} -> (known after apply)
          - node_public_ip_enabled        = false -> null
          ~ os_sku                        = "Ubuntu" -> (known after apply)
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "demo"
            }
          + workload_runtime              = (known after apply)
            # (22 unchanged attributes hidden)

          ~ upgrade_settings {
              ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      ~ identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ key_vault_secrets_provider {
          ~ secret_identity          = [
              - {
                  - client_id                 = "786f9dea-7df4-409f-ad5c-db39c2d419be"
                  - object_id                 = "ea9dd2e4-0353-4c7d-a4e5-a61fc1d8fa2f"
                  - user_assigned_identity_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/cft-demo-01-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-cft-demo-01-aks"
                },
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "e23ec295-d065-4725-b171-bf08823d98f4" -> null
          - object_id                 = "1180a7dc-70a3-49a0-918b-39448db80c5b" -> null
          - user_assigned_identity_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-demo-01-aks-agentpool" -> null
        }

      ~ maintenance_window_node_os {
          - day_of_month = 0 -> null
          ~ start_date   = "2024-07-04T00:00:00Z" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ network_profile {
          ~ dns_service_ip      = "10.0.0.10" -> (known after apply)
          ~ ip_versions         = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode        = (known after apply)
          + network_policy      = (known after apply)
          + pod_cidr            = (known after apply)
          ~ pod_cidrs           = [] -> (known after apply)
          ~ service_cidr        = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs       = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (5 unchanged attributes hidden)

          ~ load_balancer_profile (known after apply)
          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/6b972e0e-360f-4e53-a505-9c7e8234fd92",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }

          ~ nat_gateway_profile (known after apply)
        }

      ~ windows_profile (known after apply)
      - windows_profile {
          - admin_username = "azureuser" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks/agentPools/cronjob" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply) # forces replacement
        name                          = "cronjob"
      ~ node_count                    = 0 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

      ~ upgrade_settings {
          ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply) # forces replacement
        name                          = "linux"
      ~ node_count                    = 24 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

      ~ upgrade_settings {
          ~ drain_timeout_in_minutes      = 30 -> 0 # forces replacement
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      ~ id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks/agentPools/spotinstance" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply) # forces replacement
        name                          = "spotinstance"
      ~ node_count                    = 3 -> (known after apply)
      ~ node_labels                   = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.aks_auto_shutdown[0] must be replaced
-/+ resource "azurerm_role_assignment" "aks_auto_shutdown" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks/providers/Microsoft.Authorization/roleAssignments/0042798d-4683-fe2e-e346-cf69ec1351d9" -> (known after apply)
      ~ name                                   = "0042798d-4683-fe2e-e346-cf69ec1351d9" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.genesis_managed_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/providers/Microsoft.Authorization/roleAssignments/4065a75c-bec0-7f6a-d972-74ae870125f5" -> (known after apply)
      ~ name                                   = "4065a75c-bec0-7f6a-d972-74ae870125f5" -> (known after apply)
      ~ principal_id                           = "1180a7dc-70a3-49a0-918b-39448db80c5b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.global_registry_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "global_registry_acrpull" {
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/a2915933-157c-ef43-5218-b1312a670e6b" -> (known after apply)
      ~ name                                   = "a2915933-157c-ef43-5218-b1312a670e6b" -> (known after apply)
      ~ principal_id                           = "1180a7dc-70a3-49a0-918b-39448db80c5b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set must be replaced
-/+ resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/e381ba7b-c751-8e73-2aba-d3b6fd90f021" -> (known after apply)
      ~ name                                   = "e381ba7b-c751-8e73-2aba-d3b6fd90f021" -> (known after apply)
      ~ principal_id                           = "1180a7dc-70a3-49a0-918b-39448db80c5b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] must be replaced
-/+ resource "azurerm_role_assignment" "update_checker" {
      ~ id                                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks/providers/Microsoft.Authorization/roleAssignments/4875ad89-5105-75da-0331-15da6bb91c22" -> (known after apply)
      ~ name                                   = "4875ad89-5105-75da-0331-15da6bb91c22" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 20 to add, 2 to change, 18 to destroy.

Changes to Outputs:
  ~ kubelet_object_ids = "601cd000-4c45-4408-b193-12acfc35a5a9,1180a7dc-70a3-49a0-918b-39448db80c5b" -> (known after apply)
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/disks-demo-rg" -> null
        name       = "disks-demo-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":685,"Program":"tfcmt","SHA1":"","Target":"Aks_demo - DeployInfrastructure","Vars":{}} -->